; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_4 ?v7 - type_3 ?v4 - type_2)
 	      (pred_3 ?v3 - object ?v4 - type_2)
	      (pred_1 ?v7 - type_3 ?v8 - type_1)
	      (pred_2 ?v7 - type_3 ?v3 - object ?v8 - type_1))

   (:action op_2
       :parameters  (?v7 - type_3 ?v2 ?v1 - type_2)
       :precondition (and  (pred_4 ?v7 ?v2))
       :effect (and  (pred_4 ?v7 ?v1)
		     (not (pred_4 ?v7 ?v2))))

   (:action op_3
       :parameters (?v7 - type_3 ?v6 - object ?v5 - type_2 ?v8 - type_1)
       :precondition  (and  (pred_3 ?v6 ?v5) (pred_4 ?v7 ?v5) (pred_1 ?v7 ?v8))
       :effect (and (pred_2 ?v7 ?v6 ?v8)
		    (not (pred_3 ?v6 ?v5)) 
		    (not (pred_1 ?v7 ?v8))))

   (:action op_1
       :parameters (?v7 - type_3 ?v6 - object ?v5 - type_2 ?v8 - type_1)
       :precondition  (and  (pred_2 ?v7 ?v6 ?v8) (pred_4 ?v7 ?v5))
       :effect (and (pred_3 ?v6 ?v5)
		    (pred_1 ?v7 ?v8)
		    (not (pred_2 ?v7 ?v6 ?v8)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_10 obj_13 - type_3
obj_08 obj_11 obj_07 obj_09 - type_1
obj_01 obj_03 obj_12 obj_06 - type_2
obj_02 obj_05 obj_04 - object)
(:init
(pred_4 obj_10 obj_01)
(pred_1 obj_10 obj_08)
(pred_1 obj_10 obj_11)
(pred_4 obj_13 obj_03)
(pred_1 obj_13 obj_07)
(pred_1 obj_13 obj_09)
(pred_3 obj_02 obj_01)
(pred_3 obj_05 obj_03)
(pred_3 obj_04 obj_12)
)
(:goal
(and
(pred_3 obj_02 obj_01)
(pred_3 obj_05 obj_03)
(pred_3 obj_04 obj_03)
)
)

(:constraints
  (always (not (pred_4 obj_10 obj_12)))
)
)

; plan
1. (op_2 obj_10 obj_01 obj_03)
   deleted: (pred_4 obj_10 obj_01)
   added: (pred_4 obj_10 obj_03)
   goals met: 2 of 3
2. (op_2 obj_13 obj_03 obj_12)
   deleted: (pred_4 obj_13 obj_03)
   added: (pred_4 obj_13 obj_12)
   goals met: 2 of 3
3. (op_3 obj_13 obj_04 obj_12 obj_09)
   deleted: (pred_3 obj_04 obj_12) (pred_1 obj_13 obj_09)
   added: (pred_2 obj_13 obj_04 obj_09)
   goals met: 2 of 3
4. (op_2 obj_13 obj_12 obj_03)
   deleted: (pred_4 obj_13 obj_12)
   added: (pred_4 obj_13 obj_03)
   goals met: 2 of 3
5. (op_1 obj_13 obj_04 obj_03 obj_09)
   deleted: (pred_2 obj_13 obj_04 obj_09)
   added: (pred_3 obj_04 obj_03) (pred_1 obj_13 obj_09)
   goals met: 3 of 3
